export const COURSES_DATA = [
  {
    id: 'js-001',
    title: 'JavaScript для початківців',
    info: 'Практичний курс з основ JavaScript',
    course_modules: [
      {
        title: 'Вступ',
        info: 'Що таке JavaScript, навіщо він потрібен, і як він працює в браузері.'
      },
      {
        title: 'Модуль 1: Основи синтаксису',
        info: 'Змінні, типи даних, оператори та умовні конструкції.'
      },
      {
        title: 'Модуль 2: Функції та обʼєкти',
        info: 'Оголошення функцій, параметри, замикання, робота з обʼєктами.'
      },
      {
        title: 'Модуль 3: DOM та події',
        info: 'Маніпуляції з HTML-структурою сторінки, обробка подій.'
      }
    ]
  },
  {
    id: 'py-001',
    title: 'Python з нуля до автоматизації',
    info: 'Популярний курс з Python',
    course_modules: [
      {
        title: 'Вступ',
        info: 'Історія Python, встановлення середовища, перша програма.'
      },
      {
        title: 'Модуль 1: Основи синтаксису',
        info: 'Типи даних, змінні, введення/виведення, оператори.'
      },
      {
        title: 'Модуль 2: Цикли та функції',
        info: 'for/while, функції, параметри, return.'
      },
      {
        title: 'Модуль 3: Робота з файлами та модулями',
        info: 'Читання/запис файлів, бібліотеки, pip, структурування коду.'
      },
      {
        title: 'Модуль 4: ООП у Python',
        info: 'Класи, наслідування, інкапсуляція.'
      }
    ]
  },
  {
    id: 'cs-001',
    title: 'C# WinForms для створення застосунків',
    info: 'Покроковий курс зі створення віконних застосунків у C#',
    course_modules: [
      {
        title: 'Вступ',
        info: 'Огляд середовища Visual Studio, структура WinForms-проєкту.'
      },
      {
        title: 'Модуль 1: Робота з формами та елементами UI',
        info: 'Додавання кнопок, текстбоксів, лейблів. Події Click, TextChanged.'
      },
      {
        title: 'Модуль 2: Логіка застосунку',
        info: 'Написання обробників, взаємодія між формами.'
      },
      {
        title: 'Модуль 3: Збереження даних',
        info: 'Робота з файлами, серіалізація, підключення до Access або SQL Server.'
      }
    ]
  }
];


export const LESSONS_DATA = [
  {
    courseId: 'js-001',
    lessons: [
      {
        lessonIdx: 1,
      title: 'Вітаємо на першому уроці JavaScript для початківців!'
    },
    {
        lessonIdx: 2,
        title: 'Джаваскріпт урок 2'
    },
    {
        lessonIdx: 3,
        title: 'Джаваскріпт урок 3'
    },
    ]
  },
  {
    courseId: 'py-001',
    lessons: [
      {
        lessonIdx: 1,
      title: 'Вітаємо на першому уроці Python для початківців!'
    },
    {
        lessonIdx: 2,
        title: 'Python урок 2'
    },
    {
        lessonIdx: 3,
        title: 'Python урок 3'
    },
    ]
  },
  {
    courseId: 'cs-001',
    lessons: [
      {
        lessonIdx: 1,
      title: 'Вітаємо на першому уроці C# для початківців!'
    },
    {
        lessonIdx: 2,
        title: 'C# урок 2'
    },
    {
        lessonIdx: 3,
        title: 'C# урок 3'
    },
    ]
  },
]